{"lr": 0.006336073391139507,"class_name": "Model", "config": {"name": "model", "layers": [{"name": "input_1", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 304], "dtype": "float32", "sparse": false, "name": "input_1"}, "inbound_nodes": []}, {"name": "dense", "class_name": "Dense", "config": {"name": "dense", "trainable": true, "dtype": "float32", "units": 219, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"name": "leaky_re_lu", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu", "trainable": true, "dtype": "float32", "alpha": 0.00881928764283657}, "inbound_nodes": [[["dense", 0, 0, {}]]]}, {"name": "dropout", "class_name": "Dropout", "config": {"name": "dropout", "trainable": true, "dtype": "float32", "rate": 0.3895607841972732, "noise_shape": null, "seed": null}, "inbound_nodes": [[["leaky_re_lu", 0, 0, {}]]]}, {"name": "batch_normalization", "class_name": "BatchNormalization", "config": {"name": "batch_normalization", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["dropout", 0, 0, {}]]]}, {"name": "dense_1", "class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": "float32", "units": 499, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["batch_normalization", 0, 0, {}]]]}, {"name": "leaky_re_lu_1", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_1", "trainable": true, "dtype": "float32", "alpha": 0.00881928764283657}, "inbound_nodes": [[["dense_1", 0, 0, {}]]]}, {"name": "dropout_1", "class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "dtype": "float32", "rate": 0.3895607841972732, "noise_shape": null, "seed": null}, "inbound_nodes": [[["leaky_re_lu_1", 0, 0, {}]]]}, {"name": "batch_normalization_1", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_1", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["dropout_1", 0, 0, {}]]]}, {"name": "dense_2", "class_name": "Dense", "config": {"name": "dense_2", "trainable": true, "dtype": "float32", "units": 397, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]]}, {"name": "leaky_re_lu_2", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_2", "trainable": true, "dtype": "float32", "alpha": 0.00881928764283657}, "inbound_nodes": [[["dense_2", 0, 0, {}]]]}, {"name": "dropout_2", "class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "dtype": "float32", "rate": 0.3895607841972732, "noise_shape": null, "seed": null}, "inbound_nodes": [[["leaky_re_lu_2", 0, 0, {}]]]}, {"name": "batch_normalization_2", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_2", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["dropout_2", 0, 0, {}]]]}, {"name": "dense_3", "class_name": "Dense", "config": {"name": "dense_3", "trainable": true, "dtype": "float32", "units": 133, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]]}, {"name": "leaky_re_lu_3", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_3", "trainable": true, "dtype": "float32", "alpha": 0.00881928764283657}, "inbound_nodes": [[["dense_3", 0, 0, {}]]]}, {"name": "dropout_3", "class_name": "Dropout", "config": {"name": "dropout_3", "trainable": true, "dtype": "float32", "rate": 0.3895607841972732, "noise_shape": null, "seed": null}, "inbound_nodes": [[["leaky_re_lu_3", 0, 0, {}]]]}, {"name": "batch_normalization_3", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_3", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["dropout_3", 0, 0, {}]]]}, {"name": "dense_4", "class_name": "Dense", "config": {"name": "dense_4", "trainable": true, "dtype": "float32", "units": 77, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]]}, {"name": "leaky_re_lu_4", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_4", "trainable": true, "dtype": "float32", "alpha": 0.00881928764283657}, "inbound_nodes": [[["dense_4", 0, 0, {}]]]}, {"name": "dropout_4", "class_name": "Dropout", "config": {"name": "dropout_4", "trainable": true, "dtype": "float32", "rate": 0.3895607841972732, "noise_shape": null, "seed": null}, "inbound_nodes": [[["leaky_re_lu_4", 0, 0, {}]]]}, {"name": "batch_normalization_4", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_4", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["dropout_4", 0, 0, {}]]]}, {"name": "dense_5", "class_name": "Dense", "config": {"name": "dense_5", "trainable": true, "dtype": "float32", "units": 214, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]]}, {"name": "leaky_re_lu_5", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_5", "trainable": true, "dtype": "float32", "alpha": 0.30000001192092896}, "inbound_nodes": [[["dense_5", 0, 0, {}]]]}, {"name": "sur_rad_layer", "class_name": "SurRadLayer", "config": {"name": "sur_rad_layer", "trainable": true, "dtype": "float32", "inp_sub": [7.55268729335512e-07, 7.55268729335512e-07, 7.55268729335512e-07, 7.55268729335512e-07, 7.552904435215169e-07, 7.553596219622705e-07, 7.70163637753285e-07, 9.026652492138965e-07, 1.0735515161286457e-06, 1.557689643050253e-06, 2.935375732704415e-06, 7.151213139877655e-06, 1.7234546248801053e-05, 3.774608558160253e-05, 7.652229396626353e-05, 0.00014338282926473767, 0.0002568553027231246, 0.000451793079264462, 0.0007878766627982259, 0.0012675697216764092, 0.0019393592374399304, 0.003101150505244732, 0.004315158352255821, 0.005022247787564993, 0.005503219552338123, 0.005865762941539288, 0.006117069162428379, 0.006278122775256634, 0.0063901860266923904, 0.0067285578697919846, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 7.507892574973141e-30, 1.2382305250580039e-11, 8.808527951487122e-08, 9.903588988890988e-07, 2.4753624074946856e-06, 4.367266683402704e-06, 7.968377758515999e-06, 1.5177992281678598e-05, 3.022085365955718e-05, 3.627334444900043e-05, 2.845338349288795e-05, 2.2043710487196222e-05, 1.3734884305449668e-05, 7.416980224661529e-06, 4.909055405732943e-06, 4.610615633282578e-06, 1.6919633472056717e-09, 1.891384160401799e-09, 3.068513887427571e-09, 1.7372383045999307e-11, 6.6387268946033196e-12, 7.546829480786776e-12, 5.581912709828885e-10, 2.728281778274777e-08, 1.24985945149092e-07, 4.552654218059615e-07, 1.1164671605001786e-06, 2.0658862922573462e-06, 3.0728372166777262e-06, 4.053408702020533e-06, 5.026327471568948e-06, 5.6050603234325536e-06, 5.936812613072107e-06, 5.770912139269058e-06, 5.205488832871197e-06, 4.566418738249922e-06, 3.909638053301023e-06, 3.874067260767333e-06, 4.668462679546792e-06, 6.0654597291431855e-06, 4.673423973144963e-06, 2.351582224946469e-06, 4.196823795155069e-07, 1.0292714236470601e-08, 2.025747347644824e-09, 1.5568968336765465e-09, 101.37045288085938, 101.37045288085938, 101.37045288085938, 101.37045288085938, 101.37045288085938, 101.37045288085938, 101.37045288085938, 101.37045288085938, 101.37045288085938, 101.37045288085938, 101.37045288085938, 101.37045288085938, 101.37045288085938, 101.37045288085938, 101.37045288085938, 101.37045288085938, 147.73773193359375, 193.94931030273438, 202.74090576171875, 202.74090576171875, 202.74090576171875, 202.74090576171875, 202.74090576171875, 202.74090576171875, 202.74090576171875, 202.74090576171875, 202.74090576171875, 202.74090576171875, 202.74090576171875, 202.74090576171875, 0.23119522631168365, 0.055862318724393845, 0.05816882848739624, -0.048035718500614166, 0.05580879747867584, -0.03380139544606209, 0.02131057158112526, -0.06863027811050415, -0.08753838390111923, -0.17309659719467163, -0.3094503879547119, -0.4629751741886139, -0.5214840769767761, -0.40776634216308594, -0.1426660716533661, 0.07885834574699402, 0.12999679148197174, 0.08648510277271271, 0.0422622375190258, 0.014475093223154545, 0.009365812875330448, 0.02956090308725834, 0.10202612727880478, 0.17321912944316864, 0.19029411673545837, 0.2001497894525528, 0.24160276353359222, 0.302471399307251, 0.339191198348999, 0.35804399847984314, -1.1374608937034236e-14, -1.1120671847579186e-14, 1.8378274433978464e-13, -1.188266743031366e-13, 2.014956703279367e-15, 4.517897981317883e-15, 8.124090355792705e-15, 1.880221205238699e-14, 6.362286457221866e-13, 4.061602616733939e-12, 1.8763044937197826e-11, 7.056990408704777e-11, 2.1775216352271087e-10, 5.512969525334199e-10, 1.0729348520754911e-09, 1.659891446514905e-09, 2.349919814292889e-09, 2.8727882295243035e-09, 3.225665068384842e-09, 3.2467375454814373e-09, 2.1951267470399216e-09, -1.3550846000853767e-09, -4.484908888713335e-09, -3.5312897050943093e-09, -4.154595334426858e-09, -4.6402344189289124e-09, -4.511530260487007e-09, -5.399677593942442e-09, -5.607480701996792e-09, -6.230790106087625e-09, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 4.171051053402863e-33, 6.879051449700186e-15, 4.8865668456077316e-11, 7.008230801242021e-11, 7.264934487327679e-11, 1.031481636215581e-10, 7.657374734293398e-11, 5.057023376442427e-12, -8.302039611329803e-11, -3.7217126602762107e-10, -9.716442928020541e-11, -1.3419880484644153e-10, -1.145019357107202e-10, -9.398389011483488e-11, -7.458213907574063e-11, -4.407610734724621e-11, -1.4807786970507826e-17, -2.6317406315419717e-17, 8.608337397672094e-15, 2.4668868971221627e-15, 3.569122215766254e-17, 9.842663798671349e-17, 8.730179699002836e-15, 6.750446555903178e-13, 3.878290483899649e-12, 1.6693693302705093e-11, 4.3628343993074026e-11, 7.555022579763815e-11, 1.0181251675067671e-10, 1.2134566962362925e-10, 9.850231741381776e-11, 5.699129362879418e-11, -4.9458714901362555e-11, -5.796429655702262e-11, -2.0503855557851836e-11, -3.8654544842753324e-11, -2.3857126343895807e-11, -9.113007223837677e-12, -4.03378675947752e-12, -2.1622309845370502e-11, -6.621997221400999e-12, 4.8090073589968085e-12, 6.610030665182842e-12, 7.40865376859523e-13, 4.205570082720794e-14, 1.9189378954115668e-14, -1.1837834108519019e-06, 6.582742457794666e-07, 9.945962119672913e-06, -1.5258240637194831e-05, 1.7628684645387693e-06, 1.276405043881823e-07, 7.419087637572375e-07, 5.193189167584933e-07, 1.1548004863470851e-07, 5.186102498555556e-07, 1.3116064110363368e-06, 2.8384927190927556e-06, 3.7687520944018615e-06, 4.532136699708644e-06, 4.772604370373301e-06, 4.934630851494148e-06, 4.487718342716107e-06, 3.191688165316009e-06, 1.2305292784731137e-06, 2.6524978125053167e-07, 1.0287072882420034e-06, 3.418871528992895e-06, 3.228068408134277e-06, -2.283769617861253e-06, -4.625967449101154e-06, -6.918992767168675e-06, -7.79759375291178e-06, -7.685282980673946e-06, -6.131866939540487e-06, 6.962197858229047e-06, 4.882785376025822e-08, 9.351663443624147e-09, -9.570916148504693e-08, -3.8513533695549995e-08, -1.179786401905858e-08, -5.5705631218927465e-09, -3.883793553427495e-08, -9.207394668919733e-08, 1.4815240589882706e-08, 6.34935872767528e-08, 5.954213122549845e-08, 3.9442804578015966e-10, -8.504481741056225e-08, -1.3037542601068708e-07, 1.0129797800573215e-07, 1.3206984306179947e-07, -5.892294208109661e-09, -2.7554312609368026e-08, -1.3879163596186572e-08, -1.0775099035242874e-08, -2.5526526670205385e-08, -3.086111632910615e-08, -2.060108954538009e-07, -5.799428208774771e-07, -1.6459423477499513e-06, -4.009712029073853e-06, -3.2592640764050884e-06, 5.0246057980984915e-06, 1.7051994291250594e-05, 3.0471586796920747e-05, 51901.671875, 316.9693603515625, 10.055919647216797, 63.86154556274414], "inp_div": [0.004063558764755726, 0.004063558764755726, 0.004063558764755726, 0.004063558764755726, 0.004063558764755726, 0.004063558764755726, 0.004063558764755726, 0.004063558764755726, 0.004063558764755726, 0.004063558764755726, 0.004063558764755726, 0.004063558764755726, 0.004063558764755726, 0.004063558764755726, 0.004063558764755726, 0.004063558764755726, 0.004741851706057787, 0.006551146041601896, 0.00859819445759058, 0.010981806553900242, 0.013460435904562473, 0.01543631125241518, 0.01723513752222061, 0.018423395231366158, 0.019028371199965477, 0.019481634721159935, 0.019805477932095528, 0.02047581598162651, 0.021272171288728714, 0.0235811248421669, 3.0281913495855406e-05, 3.0281913495855406e-05, 3.0281913495855406e-05, 3.0281913495855406e-05, 3.0281913495855406e-05, 3.0281913495855406e-05, 3.0281913495855406e-05, 3.0281913495855406e-05, 3.0281913495855406e-05, 3.0281913495855406e-05, 3.0281913495855406e-05, 3.0281913495855406e-05, 3.0281913495855406e-05, 3.0281913495855406e-05, 3.0281913495855406e-05, 3.0281913495855406e-05, 0.00013244814181234688, 0.0004088823916390538, 0.0009107368532568216, 0.0010117710335180163, 0.0009558243909850717, 0.0009427234763279557, 0.0009216921171173453, 0.0010570865124464035, 0.0009785281727090478, 0.0009978419402614236, 0.0010059899650514126, 0.0010469637345522642, 0.001062573748640716, 0.0013720797142013907, 1.282726225326769e-05, 1.282726225326769e-05, 1.282726225326769e-05, 1.282726225326769e-05, 1.282726225326769e-05, 2.4925187972257845e-05, 0.00035530488821677864, 0.001862895442172885, 0.0019150590524077415, 0.0018236220348626375, 0.0017689866945147514, 0.0015390969347208738, 0.0014938439708203077, 0.0014315973967313766, 0.0010516485199332237, 0.0009238873608410358, 0.0010885023511946201, 0.0007206769078038633, 0.0005931169725954533, 0.0004473700246307999, 0.0003611101710703224, 0.0002947794855572283, 0.00023128664179239422, 0.0002269441174576059, 0.0001374698185827583, 9.248973219655454e-05, 7.027757965261117e-05, 5.551839421968907e-05, 6.310094613581896e-05, 7.785188790876418e-05, 92.19589233398438, 85.40951538085938, 87.54721069335938, 67.10308837890625, 61.389373779296875, 54.013458251953125, 65.38336181640625, 58.18449401855469, 49.723663330078125, 45.952545166015625, 45.83290100097656, 43.62818908691406, 42.1153564453125, 42.596038818359375, 46.35731506347656, 52.109832763671875, 51.97245788574219, 50.435089111328125, 49.006500244140625, 46.57490539550781, 44.61772155761719, 41.90228271484375, 39.087860107421875, 37.70843505859375, 36.755706787109375, 36.88079833984375, 36.2667236328125, 33.9884033203125, 33.370330810546875, 35.961212158203125, 272.952880859375, 193.27847290039062, 150.65286254882812, 125.35087585449219, 102.0775146484375, 93.39217376708984, 90.79302978515625, 91.94343566894531, 108.99003601074219, 125.57243347167969, 142.38723754882812, 167.35006713867188, 176.865966796875, 180.11334228515625, 177.5843505859375, 164.63404846191406, 146.14157104492188, 124.46488189697266, 107.07469177246094, 88.81344604492188, 74.71648406982422, 85.90265655517578, 98.04557800292969, 100.68736267089844, 100.92720031738281, 97.14775085449219, 88.52250671386719, 81.70960235595703, 76.74472045898438, 69.91130065917969, 2.2990510828435617e-08, 2.2990510828435617e-08, 2.2990510828435617e-08, 2.2990510828435617e-08, 2.2990510828435617e-08, 2.2990510828435617e-08, 2.2990510828435617e-08, 2.2990510828435617e-08, 2.2990510828435617e-08, 2.2990510828435617e-08, 2.2990510828435617e-08, 4.303028333652037e-08, 1.141138312732437e-07, 2.1309082853804284e-07, 3.689726497668744e-07, 5.616328735413845e-07, 7.707137683610199e-07, 8.83743496160605e-07, 9.681333494881983e-07, 1.1440961316111498e-06, 1.3288539548739209e-06, 1.310750349148293e-06, 1.3351016150409123e-06, 1.2853452062699944e-06, 1.3218671028880635e-06, 1.5074493830979918e-06, 2.0413758647919167e-06, 1.8656286329132854e-06, 3.3051264836103655e-06, 5.749898718931945e-06, 2.077070293537986e-09, 2.077070293537986e-09, 2.077070293537986e-09, 2.077070293537986e-09, 2.077070293537986e-09, 2.077070293537986e-09, 2.077070293537986e-09, 2.077070293537986e-09, 2.077070293537986e-09, 2.077070293537986e-09, 2.077070293537986e-09, 2.077070293537986e-09, 2.077070293537986e-09, 2.077070293537986e-09, 2.077070293537986e-09, 1.2104149682556908e-08, 7.542816149452847e-08, 1.2329971355029556e-07, 2.0313679272021545e-07, 2.1460272137119318e-07, 2.3706243723609077e-07, 2.6624175575307163e-07, 3.064144493691856e-07, 2.846341544682218e-07, 2.3507288915425306e-07, 2.7640044208965264e-07, 4.788235514752159e-07, 4.6814474785605853e-07, 8.349380777872284e-07, 1.6583129536229535e-06, 1.3350714977988787e-09, 1.3350714977988787e-09, 1.3350714977988787e-09, 1.3350714977988787e-09, 1.3350714977988787e-09, 1.3350714977988787e-09, 3.102386969544568e-08, 1.7642486227487097e-07, 2.516112544981297e-07, 3.502055960780126e-07, 4.088223022336024e-07, 5.851788955624215e-07, 4.598150553647429e-07, 4.130267825530609e-07, 4.822234700441186e-07, 4.1976710463131894e-07, 5.29011572325544e-07, 6.530608516186476e-07, 5.767054744865163e-07, 4.2313371295676916e-07, 3.593018504943757e-07, 2.93357118152926e-07, 2.7903314503419097e-07, 2.1785905346405343e-07, 1.3333070114640577e-07, 1.0877494105443475e-07, 6.021264908895319e-08, 2.108302865622136e-08, 5.534077196500675e-09, 3.963539718654374e-09, 0.0021413506474345922, 0.0016298166010528803, 0.0013427988160401583, 0.0009984334465116262, 0.0007974497275426984, 0.0009874640963971615, 0.0012199486372992396, 0.001813557930290699, 0.0016635725041851401, 0.0017616950208321214, 0.002634463831782341, 0.003256725613027811, 0.003354797139763832, 0.0031116059981286526, 0.0023402657825499773, 0.002443406730890274, 0.0024262662045657635, 0.0024602762423455715, 0.0024669307749718428, 0.002239566296339035, 0.001988356001675129, 0.0019536337349563837, 0.001910824328660965, 0.002146097831428051, 0.0018213908188045025, 0.001711883582174778, 0.0015544637572020292, 0.001733788289129734, 0.0012764146085828543, 0.00279218889772892, 0.00849653035402298, 0.0052391053177416325, 0.002882590750232339, 0.0018665975658223033, 0.0015157980378717184, 0.001540441531687975, 0.002076676581054926, 0.002718994626775384, 0.0030859827529639006, 0.003940871451050043, 0.005098298192024231, 0.005922650918364525, 0.006498787086457014, 0.006791053339838982, 0.006959420163184404, 0.006794240325689316, 0.006004102993756533, 0.005055761430412531, 0.00413975864648819, 0.0036077271215617657, 0.0036669031251221895, 0.004086698405444622, 0.005516404751688242, 0.006096619181334972, 0.006373243406414986, 0.00601665023714304, 0.005862844176590443, 0.00576842250302434, 0.005763365887105465, 0.00654865987598896, 14538.2109375, 1410.6441650390625, 352.5914001464844, 879.6205444335938], "norm_q": [70811688.0, 130741960.0, 214169696.0, 308955072.0, 387624512.0, 445204576.0, 443213408.0, 363172864.0, 427253600.0, 502641728.0, 591332672.0, 695671488.0, 818421504.0, 962831040.0, 1132721152.0, 1332586752.0, 1567720192.0, 1844340992.0, 2169772032.0, 2170640640.0, 1992220544.0, 1681176832.0, 1249475328.0, 723361920.0, 678637632.0, 628423872.0, 573029568.0, 512799360.0, 448201600.0, 379704384.0], "hyai": [0.002255239523947239, 0.005031691864132881, 0.010157947428524494, 0.01855531707406044, 0.03066912293434143, 0.04586747661232948, 0.0633234828710556, 0.08070141822099686, 0.09494104236364365, 0.11169321089982986, 0.13140127062797546, 0.1545868068933487, 0.18186335265636444, 0.17459799349308014, 0.16605065762996674, 0.15599516034126282, 0.14416541159152985, 0.1302483081817627, 0.11387556791305542, 0.09461385756731033, 0.07534445077180862, 0.05765894055366516, 0.04273463785648346, 0.03164267912507057, 0.025221217423677444, 0.019196737557649612, 0.013618026860058308, 0.008531088940799236, 0.003978818189352751, 0.0, 0.0], "hybi": [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.039354827255010605, 0.08565375953912735, 0.14012205600738525, 0.20420117676258087, 0.27958691120147705, 0.36827436089515686, 0.47261056303977966, 0.5769885182380676, 0.6727869510650635, 0.7536284327507019, 0.8137109875679016, 0.8484946489334106, 0.8811278939247131, 0.911346435546875, 0.9389012455940247, 0.9635598063468933, 0.985112190246582, 1.0]}, "inbound_nodes": [[["input_1", 0, 0, {}], ["leaky_re_lu_5", 0, 0, {}]]]}, {"name": "mass_cons_layer", "class_name": "MassConsLayer", "config": {"name": "mass_cons_layer", "trainable": true, "dtype": "float32", "inp_sub": [7.55268729335512e-07, 7.55268729335512e-07, 7.55268729335512e-07, 7.55268729335512e-07, 7.552904435215169e-07, 7.553596219622705e-07, 7.70163637753285e-07, 9.026652492138965e-07, 1.0735515161286457e-06, 1.557689643050253e-06, 2.935375732704415e-06, 7.151213139877655e-06, 1.7234546248801053e-05, 3.774608558160253e-05, 7.652229396626353e-05, 0.00014338282926473767, 0.0002568553027231246, 0.000451793079264462, 0.0007878766627982259, 0.0012675697216764092, 0.0019393592374399304, 0.003101150505244732, 0.004315158352255821, 0.005022247787564993, 0.005503219552338123, 0.005865762941539288, 0.006117069162428379, 0.006278122775256634, 0.0063901860266923904, 0.0067285578697919846, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 7.507892574973141e-30, 1.2382305250580039e-11, 8.808527951487122e-08, 9.903588988890988e-07, 2.4753624074946856e-06, 4.367266683402704e-06, 7.968377758515999e-06, 1.5177992281678598e-05, 3.022085365955718e-05, 3.627334444900043e-05, 2.845338349288795e-05, 2.2043710487196222e-05, 1.3734884305449668e-05, 7.416980224661529e-06, 4.909055405732943e-06, 4.610615633282578e-06, 1.6919633472056717e-09, 1.891384160401799e-09, 3.068513887427571e-09, 1.7372383045999307e-11, 6.6387268946033196e-12, 7.546829480786776e-12, 5.581912709828885e-10, 2.728281778274777e-08, 1.24985945149092e-07, 4.552654218059615e-07, 1.1164671605001786e-06, 2.0658862922573462e-06, 3.0728372166777262e-06, 4.053408702020533e-06, 5.026327471568948e-06, 5.6050603234325536e-06, 5.936812613072107e-06, 5.770912139269058e-06, 5.205488832871197e-06, 4.566418738249922e-06, 3.909638053301023e-06, 3.874067260767333e-06, 4.668462679546792e-06, 6.0654597291431855e-06, 4.673423973144963e-06, 2.351582224946469e-06, 4.196823795155069e-07, 1.0292714236470601e-08, 2.025747347644824e-09, 1.5568968336765465e-09, 101.37045288085938, 101.37045288085938, 101.37045288085938, 101.37045288085938, 101.37045288085938, 101.37045288085938, 101.37045288085938, 101.37045288085938, 101.37045288085938, 101.37045288085938, 101.37045288085938, 101.37045288085938, 101.37045288085938, 101.37045288085938, 101.37045288085938, 101.37045288085938, 147.73773193359375, 193.94931030273438, 202.74090576171875, 202.74090576171875, 202.74090576171875, 202.74090576171875, 202.74090576171875, 202.74090576171875, 202.74090576171875, 202.74090576171875, 202.74090576171875, 202.74090576171875, 202.74090576171875, 202.74090576171875, 0.23119522631168365, 0.055862318724393845, 0.05816882848739624, -0.048035718500614166, 0.05580879747867584, -0.03380139544606209, 0.02131057158112526, -0.06863027811050415, -0.08753838390111923, -0.17309659719467163, -0.3094503879547119, -0.4629751741886139, -0.5214840769767761, -0.40776634216308594, -0.1426660716533661, 0.07885834574699402, 0.12999679148197174, 0.08648510277271271, 0.0422622375190258, 0.014475093223154545, 0.009365812875330448, 0.02956090308725834, 0.10202612727880478, 0.17321912944316864, 0.19029411673545837, 0.2001497894525528, 0.24160276353359222, 0.302471399307251, 0.339191198348999, 0.35804399847984314, -1.1374608937034236e-14, -1.1120671847579186e-14, 1.8378274433978464e-13, -1.188266743031366e-13, 2.014956703279367e-15, 4.517897981317883e-15, 8.124090355792705e-15, 1.880221205238699e-14, 6.362286457221866e-13, 4.061602616733939e-12, 1.8763044937197826e-11, 7.056990408704777e-11, 2.1775216352271087e-10, 5.512969525334199e-10, 1.0729348520754911e-09, 1.659891446514905e-09, 2.349919814292889e-09, 2.8727882295243035e-09, 3.225665068384842e-09, 3.2467375454814373e-09, 2.1951267470399216e-09, -1.3550846000853767e-09, -4.484908888713335e-09, -3.5312897050943093e-09, -4.154595334426858e-09, -4.6402344189289124e-09, -4.511530260487007e-09, -5.399677593942442e-09, -5.607480701996792e-09, -6.230790106087625e-09, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 4.171051053402863e-33, 6.879051449700186e-15, 4.8865668456077316e-11, 7.008230801242021e-11, 7.264934487327679e-11, 1.031481636215581e-10, 7.657374734293398e-11, 5.057023376442427e-12, -8.302039611329803e-11, -3.7217126602762107e-10, -9.716442928020541e-11, -1.3419880484644153e-10, -1.145019357107202e-10, -9.398389011483488e-11, -7.458213907574063e-11, -4.407610734724621e-11, -1.4807786970507826e-17, -2.6317406315419717e-17, 8.608337397672094e-15, 2.4668868971221627e-15, 3.569122215766254e-17, 9.842663798671349e-17, 8.730179699002836e-15, 6.750446555903178e-13, 3.878290483899649e-12, 1.6693693302705093e-11, 4.3628343993074026e-11, 7.555022579763815e-11, 1.0181251675067671e-10, 1.2134566962362925e-10, 9.850231741381776e-11, 5.699129362879418e-11, -4.9458714901362555e-11, -5.796429655702262e-11, -2.0503855557851836e-11, -3.8654544842753324e-11, -2.3857126343895807e-11, -9.113007223837677e-12, -4.03378675947752e-12, -2.1622309845370502e-11, -6.621997221400999e-12, 4.8090073589968085e-12, 6.610030665182842e-12, 7.40865376859523e-13, 4.205570082720794e-14, 1.9189378954115668e-14, -1.1837834108519019e-06, 6.582742457794666e-07, 9.945962119672913e-06, -1.5258240637194831e-05, 1.7628684645387693e-06, 1.276405043881823e-07, 7.419087637572375e-07, 5.193189167584933e-07, 1.1548004863470851e-07, 5.186102498555556e-07, 1.3116064110363368e-06, 2.8384927190927556e-06, 3.7687520944018615e-06, 4.532136699708644e-06, 4.772604370373301e-06, 4.934630851494148e-06, 4.487718342716107e-06, 3.191688165316009e-06, 1.2305292784731137e-06, 2.6524978125053167e-07, 1.0287072882420034e-06, 3.418871528992895e-06, 3.228068408134277e-06, -2.283769617861253e-06, -4.625967449101154e-06, -6.918992767168675e-06, -7.79759375291178e-06, -7.685282980673946e-06, -6.131866939540487e-06, 6.962197858229047e-06, 4.882785376025822e-08, 9.351663443624147e-09, -9.570916148504693e-08, -3.8513533695549995e-08, -1.179786401905858e-08, -5.5705631218927465e-09, -3.883793553427495e-08, -9.207394668919733e-08, 1.4815240589882706e-08, 6.34935872767528e-08, 5.954213122549845e-08, 3.9442804578015966e-10, -8.504481741056225e-08, -1.3037542601068708e-07, 1.0129797800573215e-07, 1.3206984306179947e-07, -5.892294208109661e-09, -2.7554312609368026e-08, -1.3879163596186572e-08, -1.0775099035242874e-08, -2.5526526670205385e-08, -3.086111632910615e-08, -2.060108954538009e-07, -5.799428208774771e-07, -1.6459423477499513e-06, -4.009712029073853e-06, -3.2592640764050884e-06, 5.0246057980984915e-06, 1.7051994291250594e-05, 3.0471586796920747e-05, 51901.671875, 316.9693603515625, 10.055919647216797, 63.86154556274414], "inp_div": [0.004063558764755726, 0.004063558764755726, 0.004063558764755726, 0.004063558764755726, 0.004063558764755726, 0.004063558764755726, 0.004063558764755726, 0.004063558764755726, 0.004063558764755726, 0.004063558764755726, 0.004063558764755726, 0.004063558764755726, 0.004063558764755726, 0.004063558764755726, 0.004063558764755726, 0.004063558764755726, 0.004741851706057787, 0.006551146041601896, 0.00859819445759058, 0.010981806553900242, 0.013460435904562473, 0.01543631125241518, 0.01723513752222061, 0.018423395231366158, 0.019028371199965477, 0.019481634721159935, 0.019805477932095528, 0.02047581598162651, 0.021272171288728714, 0.0235811248421669, 3.0281913495855406e-05, 3.0281913495855406e-05, 3.0281913495855406e-05, 3.0281913495855406e-05, 3.0281913495855406e-05, 3.0281913495855406e-05, 3.0281913495855406e-05, 3.0281913495855406e-05, 3.0281913495855406e-05, 3.0281913495855406e-05, 3.0281913495855406e-05, 3.0281913495855406e-05, 3.0281913495855406e-05, 3.0281913495855406e-05, 3.0281913495855406e-05, 3.0281913495855406e-05, 0.00013244814181234688, 0.0004088823916390538, 0.0009107368532568216, 0.0010117710335180163, 0.0009558243909850717, 0.0009427234763279557, 0.0009216921171173453, 0.0010570865124464035, 0.0009785281727090478, 0.0009978419402614236, 0.0010059899650514126, 0.0010469637345522642, 0.001062573748640716, 0.0013720797142013907, 1.282726225326769e-05, 1.282726225326769e-05, 1.282726225326769e-05, 1.282726225326769e-05, 1.282726225326769e-05, 2.4925187972257845e-05, 0.00035530488821677864, 0.001862895442172885, 0.0019150590524077415, 0.0018236220348626375, 0.0017689866945147514, 0.0015390969347208738, 0.0014938439708203077, 0.0014315973967313766, 0.0010516485199332237, 0.0009238873608410358, 0.0010885023511946201, 0.0007206769078038633, 0.0005931169725954533, 0.0004473700246307999, 0.0003611101710703224, 0.0002947794855572283, 0.00023128664179239422, 0.0002269441174576059, 0.0001374698185827583, 9.248973219655454e-05, 7.027757965261117e-05, 5.551839421968907e-05, 6.310094613581896e-05, 7.785188790876418e-05, 92.19589233398438, 85.40951538085938, 87.54721069335938, 67.10308837890625, 61.389373779296875, 54.013458251953125, 65.38336181640625, 58.18449401855469, 49.723663330078125, 45.952545166015625, 45.83290100097656, 43.62818908691406, 42.1153564453125, 42.596038818359375, 46.35731506347656, 52.109832763671875, 51.97245788574219, 50.435089111328125, 49.006500244140625, 46.57490539550781, 44.61772155761719, 41.90228271484375, 39.087860107421875, 37.70843505859375, 36.755706787109375, 36.88079833984375, 36.2667236328125, 33.9884033203125, 33.370330810546875, 35.961212158203125, 272.952880859375, 193.27847290039062, 150.65286254882812, 125.35087585449219, 102.0775146484375, 93.39217376708984, 90.79302978515625, 91.94343566894531, 108.99003601074219, 125.57243347167969, 142.38723754882812, 167.35006713867188, 176.865966796875, 180.11334228515625, 177.5843505859375, 164.63404846191406, 146.14157104492188, 124.46488189697266, 107.07469177246094, 88.81344604492188, 74.71648406982422, 85.90265655517578, 98.04557800292969, 100.68736267089844, 100.92720031738281, 97.14775085449219, 88.52250671386719, 81.70960235595703, 76.74472045898438, 69.91130065917969, 2.2990510828435617e-08, 2.2990510828435617e-08, 2.2990510828435617e-08, 2.2990510828435617e-08, 2.2990510828435617e-08, 2.2990510828435617e-08, 2.2990510828435617e-08, 2.2990510828435617e-08, 2.2990510828435617e-08, 2.2990510828435617e-08, 2.2990510828435617e-08, 4.303028333652037e-08, 1.141138312732437e-07, 2.1309082853804284e-07, 3.689726497668744e-07, 5.616328735413845e-07, 7.707137683610199e-07, 8.83743496160605e-07, 9.681333494881983e-07, 1.1440961316111498e-06, 1.3288539548739209e-06, 1.310750349148293e-06, 1.3351016150409123e-06, 1.2853452062699944e-06, 1.3218671028880635e-06, 1.5074493830979918e-06, 2.0413758647919167e-06, 1.8656286329132854e-06, 3.3051264836103655e-06, 5.749898718931945e-06, 2.077070293537986e-09, 2.077070293537986e-09, 2.077070293537986e-09, 2.077070293537986e-09, 2.077070293537986e-09, 2.077070293537986e-09, 2.077070293537986e-09, 2.077070293537986e-09, 2.077070293537986e-09, 2.077070293537986e-09, 2.077070293537986e-09, 2.077070293537986e-09, 2.077070293537986e-09, 2.077070293537986e-09, 2.077070293537986e-09, 1.2104149682556908e-08, 7.542816149452847e-08, 1.2329971355029556e-07, 2.0313679272021545e-07, 2.1460272137119318e-07, 2.3706243723609077e-07, 2.6624175575307163e-07, 3.064144493691856e-07, 2.846341544682218e-07, 2.3507288915425306e-07, 2.7640044208965264e-07, 4.788235514752159e-07, 4.6814474785605853e-07, 8.349380777872284e-07, 1.6583129536229535e-06, 1.3350714977988787e-09, 1.3350714977988787e-09, 1.3350714977988787e-09, 1.3350714977988787e-09, 1.3350714977988787e-09, 1.3350714977988787e-09, 3.102386969544568e-08, 1.7642486227487097e-07, 2.516112544981297e-07, 3.502055960780126e-07, 4.088223022336024e-07, 5.851788955624215e-07, 4.598150553647429e-07, 4.130267825530609e-07, 4.822234700441186e-07, 4.1976710463131894e-07, 5.29011572325544e-07, 6.530608516186476e-07, 5.767054744865163e-07, 4.2313371295676916e-07, 3.593018504943757e-07, 2.93357118152926e-07, 2.7903314503419097e-07, 2.1785905346405343e-07, 1.3333070114640577e-07, 1.0877494105443475e-07, 6.021264908895319e-08, 2.108302865622136e-08, 5.534077196500675e-09, 3.963539718654374e-09, 0.0021413506474345922, 0.0016298166010528803, 0.0013427988160401583, 0.0009984334465116262, 0.0007974497275426984, 0.0009874640963971615, 0.0012199486372992396, 0.001813557930290699, 0.0016635725041851401, 0.0017616950208321214, 0.002634463831782341, 0.003256725613027811, 0.003354797139763832, 0.0031116059981286526, 0.0023402657825499773, 0.002443406730890274, 0.0024262662045657635, 0.0024602762423455715, 0.0024669307749718428, 0.002239566296339035, 0.001988356001675129, 0.0019536337349563837, 0.001910824328660965, 0.002146097831428051, 0.0018213908188045025, 0.001711883582174778, 0.0015544637572020292, 0.001733788289129734, 0.0012764146085828543, 0.00279218889772892, 0.00849653035402298, 0.0052391053177416325, 0.002882590750232339, 0.0018665975658223033, 0.0015157980378717184, 0.001540441531687975, 0.002076676581054926, 0.002718994626775384, 0.0030859827529639006, 0.003940871451050043, 0.005098298192024231, 0.005922650918364525, 0.006498787086457014, 0.006791053339838982, 0.006959420163184404, 0.006794240325689316, 0.006004102993756533, 0.005055761430412531, 0.00413975864648819, 0.0036077271215617657, 0.0036669031251221895, 0.004086698405444622, 0.005516404751688242, 0.006096619181334972, 0.006373243406414986, 0.00601665023714304, 0.005862844176590443, 0.00576842250302434, 0.005763365887105465, 0.00654865987598896, 14538.2109375, 1410.6441650390625, 352.5914001464844, 879.6205444335938], "norm_q": [70811688.0, 130741960.0, 214169696.0, 308955072.0, 387624512.0, 445204576.0, 443213408.0, 363172864.0, 427253600.0, 502641728.0, 591332672.0, 695671488.0, 818421504.0, 962831040.0, 1132721152.0, 1332586752.0, 1567720192.0, 1844340992.0, 2169772032.0, 2170640640.0, 1992220544.0, 1681176832.0, 1249475328.0, 723361920.0, 678637632.0, 628423872.0, 573029568.0, 512799360.0, 448201600.0, 379704384.0], "hyai": [0.002255239523947239, 0.005031691864132881, 0.010157947428524494, 0.01855531707406044, 0.03066912293434143, 0.04586747661232948, 0.0633234828710556, 0.08070141822099686, 0.09494104236364365, 0.11169321089982986, 0.13140127062797546, 0.1545868068933487, 0.18186335265636444, 0.17459799349308014, 0.16605065762996674, 0.15599516034126282, 0.14416541159152985, 0.1302483081817627, 0.11387556791305542, 0.09461385756731033, 0.07534445077180862, 0.05765894055366516, 0.04273463785648346, 0.03164267912507057, 0.025221217423677444, 0.019196737557649612, 0.013618026860058308, 0.008531088940799236, 0.003978818189352751, 0.0, 0.0], "hybi": [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.039354827255010605, 0.08565375953912735, 0.14012205600738525, 0.20420117676258087, 0.27958691120147705, 0.36827436089515686, 0.47261056303977966, 0.5769885182380676, 0.6727869510650635, 0.7536284327507019, 0.8137109875679016, 0.8484946489334106, 0.8811278939247131, 0.911346435546875, 0.9389012455940247, 0.9635598063468933, 0.985112190246582, 1.0]}, "inbound_nodes": [[["input_1", 0, 0, {}], ["sur_rad_layer", 0, 0, {}]]]}, {"name": "ent_cons_layer", "class_name": "EntConsLayer", "config": {"name": "ent_cons_layer", "trainable": true, "dtype": "float32", "inp_sub": [7.55268729335512e-07, 7.55268729335512e-07, 7.55268729335512e-07, 7.55268729335512e-07, 7.552904435215169e-07, 7.553596219622705e-07, 7.70163637753285e-07, 9.026652492138965e-07, 1.0735515161286457e-06, 1.557689643050253e-06, 2.935375732704415e-06, 7.151213139877655e-06, 1.7234546248801053e-05, 3.774608558160253e-05, 7.652229396626353e-05, 0.00014338282926473767, 0.0002568553027231246, 0.000451793079264462, 0.0007878766627982259, 0.0012675697216764092, 0.0019393592374399304, 0.003101150505244732, 0.004315158352255821, 0.005022247787564993, 0.005503219552338123, 0.005865762941539288, 0.006117069162428379, 0.006278122775256634, 0.0063901860266923904, 0.0067285578697919846, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 7.507892574973141e-30, 1.2382305250580039e-11, 8.808527951487122e-08, 9.903588988890988e-07, 2.4753624074946856e-06, 4.367266683402704e-06, 7.968377758515999e-06, 1.5177992281678598e-05, 3.022085365955718e-05, 3.627334444900043e-05, 2.845338349288795e-05, 2.2043710487196222e-05, 1.3734884305449668e-05, 7.416980224661529e-06, 4.909055405732943e-06, 4.610615633282578e-06, 1.6919633472056717e-09, 1.891384160401799e-09, 3.068513887427571e-09, 1.7372383045999307e-11, 6.6387268946033196e-12, 7.546829480786776e-12, 5.581912709828885e-10, 2.728281778274777e-08, 1.24985945149092e-07, 4.552654218059615e-07, 1.1164671605001786e-06, 2.0658862922573462e-06, 3.0728372166777262e-06, 4.053408702020533e-06, 5.026327471568948e-06, 5.6050603234325536e-06, 5.936812613072107e-06, 5.770912139269058e-06, 5.205488832871197e-06, 4.566418738249922e-06, 3.909638053301023e-06, 3.874067260767333e-06, 4.668462679546792e-06, 6.0654597291431855e-06, 4.673423973144963e-06, 2.351582224946469e-06, 4.196823795155069e-07, 1.0292714236470601e-08, 2.025747347644824e-09, 1.5568968336765465e-09, 101.37045288085938, 101.37045288085938, 101.37045288085938, 101.37045288085938, 101.37045288085938, 101.37045288085938, 101.37045288085938, 101.37045288085938, 101.37045288085938, 101.37045288085938, 101.37045288085938, 101.37045288085938, 101.37045288085938, 101.37045288085938, 101.37045288085938, 101.37045288085938, 147.73773193359375, 193.94931030273438, 202.74090576171875, 202.74090576171875, 202.74090576171875, 202.74090576171875, 202.74090576171875, 202.74090576171875, 202.74090576171875, 202.74090576171875, 202.74090576171875, 202.74090576171875, 202.74090576171875, 202.74090576171875, 0.23119522631168365, 0.055862318724393845, 0.05816882848739624, -0.048035718500614166, 0.05580879747867584, -0.03380139544606209, 0.02131057158112526, -0.06863027811050415, -0.08753838390111923, -0.17309659719467163, -0.3094503879547119, -0.4629751741886139, -0.5214840769767761, -0.40776634216308594, -0.1426660716533661, 0.07885834574699402, 0.12999679148197174, 0.08648510277271271, 0.0422622375190258, 0.014475093223154545, 0.009365812875330448, 0.02956090308725834, 0.10202612727880478, 0.17321912944316864, 0.19029411673545837, 0.2001497894525528, 0.24160276353359222, 0.302471399307251, 0.339191198348999, 0.35804399847984314, -1.1374608937034236e-14, -1.1120671847579186e-14, 1.8378274433978464e-13, -1.188266743031366e-13, 2.014956703279367e-15, 4.517897981317883e-15, 8.124090355792705e-15, 1.880221205238699e-14, 6.362286457221866e-13, 4.061602616733939e-12, 1.8763044937197826e-11, 7.056990408704777e-11, 2.1775216352271087e-10, 5.512969525334199e-10, 1.0729348520754911e-09, 1.659891446514905e-09, 2.349919814292889e-09, 2.8727882295243035e-09, 3.225665068384842e-09, 3.2467375454814373e-09, 2.1951267470399216e-09, -1.3550846000853767e-09, -4.484908888713335e-09, -3.5312897050943093e-09, -4.154595334426858e-09, -4.6402344189289124e-09, -4.511530260487007e-09, -5.399677593942442e-09, -5.607480701996792e-09, -6.230790106087625e-09, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 4.171051053402863e-33, 6.879051449700186e-15, 4.8865668456077316e-11, 7.008230801242021e-11, 7.264934487327679e-11, 1.031481636215581e-10, 7.657374734293398e-11, 5.057023376442427e-12, -8.302039611329803e-11, -3.7217126602762107e-10, -9.716442928020541e-11, -1.3419880484644153e-10, -1.145019357107202e-10, -9.398389011483488e-11, -7.458213907574063e-11, -4.407610734724621e-11, -1.4807786970507826e-17, -2.6317406315419717e-17, 8.608337397672094e-15, 2.4668868971221627e-15, 3.569122215766254e-17, 9.842663798671349e-17, 8.730179699002836e-15, 6.750446555903178e-13, 3.878290483899649e-12, 1.6693693302705093e-11, 4.3628343993074026e-11, 7.555022579763815e-11, 1.0181251675067671e-10, 1.2134566962362925e-10, 9.850231741381776e-11, 5.699129362879418e-11, -4.9458714901362555e-11, -5.796429655702262e-11, -2.0503855557851836e-11, -3.8654544842753324e-11, -2.3857126343895807e-11, -9.113007223837677e-12, -4.03378675947752e-12, -2.1622309845370502e-11, -6.621997221400999e-12, 4.8090073589968085e-12, 6.610030665182842e-12, 7.40865376859523e-13, 4.205570082720794e-14, 1.9189378954115668e-14, -1.1837834108519019e-06, 6.582742457794666e-07, 9.945962119672913e-06, -1.5258240637194831e-05, 1.7628684645387693e-06, 1.276405043881823e-07, 7.419087637572375e-07, 5.193189167584933e-07, 1.1548004863470851e-07, 5.186102498555556e-07, 1.3116064110363368e-06, 2.8384927190927556e-06, 3.7687520944018615e-06, 4.532136699708644e-06, 4.772604370373301e-06, 4.934630851494148e-06, 4.487718342716107e-06, 3.191688165316009e-06, 1.2305292784731137e-06, 2.6524978125053167e-07, 1.0287072882420034e-06, 3.418871528992895e-06, 3.228068408134277e-06, -2.283769617861253e-06, -4.625967449101154e-06, -6.918992767168675e-06, -7.79759375291178e-06, -7.685282980673946e-06, -6.131866939540487e-06, 6.962197858229047e-06, 4.882785376025822e-08, 9.351663443624147e-09, -9.570916148504693e-08, -3.8513533695549995e-08, -1.179786401905858e-08, -5.5705631218927465e-09, -3.883793553427495e-08, -9.207394668919733e-08, 1.4815240589882706e-08, 6.34935872767528e-08, 5.954213122549845e-08, 3.9442804578015966e-10, -8.504481741056225e-08, -1.3037542601068708e-07, 1.0129797800573215e-07, 1.3206984306179947e-07, -5.892294208109661e-09, -2.7554312609368026e-08, -1.3879163596186572e-08, -1.0775099035242874e-08, -2.5526526670205385e-08, -3.086111632910615e-08, -2.060108954538009e-07, -5.799428208774771e-07, -1.6459423477499513e-06, -4.009712029073853e-06, -3.2592640764050884e-06, 5.0246057980984915e-06, 1.7051994291250594e-05, 3.0471586796920747e-05, 51901.671875, 316.9693603515625, 10.055919647216797, 63.86154556274414], "inp_div": [0.004063558764755726, 0.004063558764755726, 0.004063558764755726, 0.004063558764755726, 0.004063558764755726, 0.004063558764755726, 0.004063558764755726, 0.004063558764755726, 0.004063558764755726, 0.004063558764755726, 0.004063558764755726, 0.004063558764755726, 0.004063558764755726, 0.004063558764755726, 0.004063558764755726, 0.004063558764755726, 0.004741851706057787, 0.006551146041601896, 0.00859819445759058, 0.010981806553900242, 0.013460435904562473, 0.01543631125241518, 0.01723513752222061, 0.018423395231366158, 0.019028371199965477, 0.019481634721159935, 0.019805477932095528, 0.02047581598162651, 0.021272171288728714, 0.0235811248421669, 3.0281913495855406e-05, 3.0281913495855406e-05, 3.0281913495855406e-05, 3.0281913495855406e-05, 3.0281913495855406e-05, 3.0281913495855406e-05, 3.0281913495855406e-05, 3.0281913495855406e-05, 3.0281913495855406e-05, 3.0281913495855406e-05, 3.0281913495855406e-05, 3.0281913495855406e-05, 3.0281913495855406e-05, 3.0281913495855406e-05, 3.0281913495855406e-05, 3.0281913495855406e-05, 0.00013244814181234688, 0.0004088823916390538, 0.0009107368532568216, 0.0010117710335180163, 0.0009558243909850717, 0.0009427234763279557, 0.0009216921171173453, 0.0010570865124464035, 0.0009785281727090478, 0.0009978419402614236, 0.0010059899650514126, 0.0010469637345522642, 0.001062573748640716, 0.0013720797142013907, 1.282726225326769e-05, 1.282726225326769e-05, 1.282726225326769e-05, 1.282726225326769e-05, 1.282726225326769e-05, 2.4925187972257845e-05, 0.00035530488821677864, 0.001862895442172885, 0.0019150590524077415, 0.0018236220348626375, 0.0017689866945147514, 0.0015390969347208738, 0.0014938439708203077, 0.0014315973967313766, 0.0010516485199332237, 0.0009238873608410358, 0.0010885023511946201, 0.0007206769078038633, 0.0005931169725954533, 0.0004473700246307999, 0.0003611101710703224, 0.0002947794855572283, 0.00023128664179239422, 0.0002269441174576059, 0.0001374698185827583, 9.248973219655454e-05, 7.027757965261117e-05, 5.551839421968907e-05, 6.310094613581896e-05, 7.785188790876418e-05, 92.19589233398438, 85.40951538085938, 87.54721069335938, 67.10308837890625, 61.389373779296875, 54.013458251953125, 65.38336181640625, 58.18449401855469, 49.723663330078125, 45.952545166015625, 45.83290100097656, 43.62818908691406, 42.1153564453125, 42.596038818359375, 46.35731506347656, 52.109832763671875, 51.97245788574219, 50.435089111328125, 49.006500244140625, 46.57490539550781, 44.61772155761719, 41.90228271484375, 39.087860107421875, 37.70843505859375, 36.755706787109375, 36.88079833984375, 36.2667236328125, 33.9884033203125, 33.370330810546875, 35.961212158203125, 272.952880859375, 193.27847290039062, 150.65286254882812, 125.35087585449219, 102.0775146484375, 93.39217376708984, 90.79302978515625, 91.94343566894531, 108.99003601074219, 125.57243347167969, 142.38723754882812, 167.35006713867188, 176.865966796875, 180.11334228515625, 177.5843505859375, 164.63404846191406, 146.14157104492188, 124.46488189697266, 107.07469177246094, 88.81344604492188, 74.71648406982422, 85.90265655517578, 98.04557800292969, 100.68736267089844, 100.92720031738281, 97.14775085449219, 88.52250671386719, 81.70960235595703, 76.74472045898438, 69.91130065917969, 2.2990510828435617e-08, 2.2990510828435617e-08, 2.2990510828435617e-08, 2.2990510828435617e-08, 2.2990510828435617e-08, 2.2990510828435617e-08, 2.2990510828435617e-08, 2.2990510828435617e-08, 2.2990510828435617e-08, 2.2990510828435617e-08, 2.2990510828435617e-08, 4.303028333652037e-08, 1.141138312732437e-07, 2.1309082853804284e-07, 3.689726497668744e-07, 5.616328735413845e-07, 7.707137683610199e-07, 8.83743496160605e-07, 9.681333494881983e-07, 1.1440961316111498e-06, 1.3288539548739209e-06, 1.310750349148293e-06, 1.3351016150409123e-06, 1.2853452062699944e-06, 1.3218671028880635e-06, 1.5074493830979918e-06, 2.0413758647919167e-06, 